Repository: common-repository/jcp-user-consent
Catalog: languages/jcp-user-consent-*.po
Languages: de_de

source: storing my data
de_de: Speicherung meiner Daten

source: I agree to %s.
de_de: Ich stimme der %s zu.

source: I agree to storing my data.
de_de: Ich stimme der Speicherung meiner Daten zu.

source: ERROR
de_de: FEHLER

source: You must agree to store your data.
de_de: Stimme der Speicherung deiner Daten zu.

source: [%s] Complete registration
de_de: [%s] Registrierung abschließen

source: Hello %s! Thanks for your registration on %s. To complete the registration process and set a password for your account please click here: %s
de_de: Hallo %s! Vielen Dank für die Anmeldung auf unserer Webseite %s. Um die Registrierung abzuschließen und ein Passwort für deinen Account festzulegen, klicke bitte hier: %s

source: Thanks for granting consent!
de_de: Danke für die erteilte Zustimmung!

source: Consent
de_de: Zustimmung

source: Granted
de_de: Erteilt

source: Account not enabled
de_de: Account ist nicht aktiviert

source: JCP User Consent
de_de: JCP Benutzerzustimmung

source: General Data Protection Regulations adjustments for user registration
de_de: Anpassungen zur Datenschutzgrundverordnung für die Benutzerregistrierung
